configuration/src/Catalogs/ВидыДеятельности/ВидыДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДеятельности</name>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>АдминистративныеВопросыОбщее</name>
      <description>Административные вопросы</description>
    </items>
    <items>
      <name>АнализТребованийОбщее</name>
      <description>Анализ требований</description>
    </items>
    <items>
      <name>АнализТребованийЗаказчика</name>
      <description>Анализ требований заказчика</description>
    </items>
    <items>
      <name>ИзучениеОбщее</name>
      <description>Изучение</description>
    </items>
    <items>
      <name>ИзучениеТехническойЗадачи</name>
      <description>Изучение технической задачи</description>
    </items>
    <items>
      <name>КонсультацияПользователей</name>
      <description>Консультация пользователей</description>
    </items>
    <items>
      <name>КонсультацияПользователейОбщее</name>
      <description>Консультация пользователей</description>
    </items>
    <items>
      <name>ОбсуждениеИзменений</name>
      <description>Обсуждение изменений</description>
    </items>
    <items>
      <name>ПодготовкаАрхитектуры</name>
      <description>Подготовка архитектуры</description>
    </items>
    <items>
      <name>ПодготовкаДокументацииОбщее</name>
      <description>Подготовка документации</description>
    </items>
    <items>
      <name>ПодготовкаДокументации</name>
      <description>Подготовка документации</description>
    </items>
    <items>
      <name>ПодготовкаТехническогоЗаданияОбщее</name>
      <description>Подготовка технического задания</description>
    </items>
    <items>
      <name>ПроектированиеОбщее</name>
      <description>Проектирование</description>
    </items>
    <items>
      <name>РеализацияИзменений</name>
      <description>Реализация изменений</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
    <items>
      <name>ТестированиеОбщее</name>
      <description>Тестирование</description>
    </items>
    <items>
      <name>ТехническиеРаботы</name>
      <description>Технические работы</description>
    </items>
  </predefined>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияВидовДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяДляСобрания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Enums/НазначенияВидовДеятельности/НазначенияВидовДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияВидовДеятельности</name>
  <enumValues>
    <name>Общее</name>
  </enumValues>
  <enumValues>
    <name>ITПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеТрудозатраты</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/ВидыДеятельности/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

// Добавляет обработчики обновления
//
// Параметры:
//  Обработчики	 - ТаблицаЗначений	 - см. ПриложениеВызовСервера.ПолучитьОбработчикиДанных
//
Процедура ДобавлениеОбработчиковОбновления(Обработчики) Экспорт     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.ВидыДеятельности.ПроверитьПредопределенныеЭлементы";
	
КонецПроцедуры

// Проверяет предопределенные настройки
//
Процедура ПроверитьПредопределенныеЭлементы() Экспорт 
	
	ЗаполнитьПредопределенныйЭлемент("CodeReview", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Ложь);
	ЗаполнитьПредопределенныйЭлемент("АдминистративныеВопросыОбщее", Перечисления.НазначенияВидовДеятельности.Общее, Истина); 
	ЗаполнитьПредопределенныйЭлемент("АнализТребованийОбщее", Перечисления.НазначенияВидовДеятельности.Общее, Ложь);
	ЗаполнитьПредопределенныйЭлемент("АнализТребованийЗаказчика", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Ложь);
	ЗаполнитьПредопределенныйЭлемент("ИзучениеОбщее", Перечисления.НазначенияВидовДеятельности.Общее, Ложь);
	ЗаполнитьПредопределенныйЭлемент("ИзучениеТехническойЗадачи", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Ложь);
	ЗаполнитьПредопределенныйЭлемент("КонсультацияПользователей", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Ложь);
	ЗаполнитьПредопределенныйЭлемент("КонсультацияПользователейОбщее", Перечисления.НазначенияВидовДеятельности.Общее, Ложь);
	ЗаполнитьПредопределенныйЭлемент("ОбсуждениеИзменений", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Истина);
	ЗаполнитьПредопределенныйЭлемент("ПодготовкаАрхитектуры", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Ложь);
	ЗаполнитьПредопределенныйЭлемент("ПодготовкаДокументацииОбщее", Перечисления.НазначенияВидовДеятельности.Общее, Ложь);
	ЗаполнитьПредопределенныйЭлемент("ПодготовкаДокументации", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Ложь);
	ЗаполнитьПредопределенныйЭлемент("ПодготовкаТехническогоЗаданияОбщее", Перечисления.НазначенияВидовДеятельности.Общее, Ложь);
	ЗаполнитьПредопределенныйЭлемент("ПроектированиеОбщее", Перечисления.НазначенияВидовДеятельности.Общее, Ложь);
	ЗаполнитьПредопределенныйЭлемент("РеализацияИзменений", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Ложь);
	ЗаполнитьПредопределенныйЭлемент("Тестирование", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Ложь);
	ЗаполнитьПредопределенныйЭлемент("ТестированиеОбщее", Перечисления.НазначенияВидовДеятельности.Общее, Ложь);
	ЗаполнитьПредопределенныйЭлемент("ТехническиеРаботы", Перечисления.НазначенияВидовДеятельности.ITПодразделение, Ложь);	
		
КонецПроцедуры     

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныйЭлемент(ИмяЭлемента, Назначение, ПрименяетсяДляСобрания) 
	
	Попытка
		Объект = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДеятельности." + ИмяЭлемента);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ВидыДеятельности." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецПопытки;
	
	Если Объект = Неопределено Тогда  
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "ПланыВидовХарактеристик.ВидыДеятельности." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
	Объект = Объект.ПолучитьОбъект();  
	
	Если НЕ ЗначениеЗаполнено(Объект.Назначение) Тогда
		Объект.Назначение = Назначение;
		Объект.ПрименяетсяДляСобрания = ПрименяетсяДляСобрания;
		Объект.Записать();
	КонецЕсли;   
	
КонецПроцедуры
 
#КонецОбласти
